{
  "name": "Durations",
  "script": "Durations.js",
  "version": "1.0",
  "previousversions": [],
  "description": "# Durations\rThank you for installing Durations! To suggest features or to report bugs, please create an issue at my [Durations repo](https://github.com/thatblindgeye/Durations).\rThe purpose of this script is to allow creating custom durations that occur during combat that last for a certain number of rounds, as well as sorting the turnorder and keeping track of the number of rounds that have elapsed.\r## Commands\rThe following list of commands are available for use, and provide the basic syntax as well as a description of what the command does/is used for. Macros for the add-duration, add-gmduration, show-gmduration, clear, and sort commands will also be created when installing the script.\r### Add duration\r`!durations add-duration|[duration name]|[duration length]|[insert at initiative]`\re.g. `!durations add-duration|Bless|10|12`\rWill add a duration to the Roll20 turnorder when it is active. This can be viewed by all players currently in the campaign.\rThe `duration length` argument must be an integer, and determines how many rounds the duration will last for. The length will display in the Roll20 turnorder as it's 'initiative', and will decrement by 1 each time its turn is reached.\rThe `insert at initiative` argument can be an integer or decimal, and determines where in the turnorder it is placed relative to other items already in the turnorder. The default value for this argument is `0`.\rThe name of duration that is added to the turnorder will combine the `duration name` and `insert at initiative` arguments. For example, `!durations add-duration|Bless|10|12` will add 'Bless (12)' to the turnorder.\r### Add GM duration\r`!durations add-gmduration|[duration name/description]|[duration length]`\re.g. `!durations add-gmduration|The goblins attack|10`\rAdds a private duration only available to the GM. GM durations are not placed in the Roll20 turnorder, but rather stored in the Durations state object.\rGM durations can act as reminders to the GM for events that will occur after a certain number of rounds, or effects that only the GM should know about.\rAt the start of each round, or when the `show-gmduration` command is called, GM durations will be sent in chat as a whisper to the GM. Each GM duration will include a button to delete that duration.\rThe `duration length` argument must be an integer, and will decrement by 1 at the start of each round.\r### Show GM duration\r`!durations show-gmduration`\rSends the current GM durations to chat as a whisper to the GM.\r### Clear turnorder\r`!durations clear`\rClears all items in the Roll20 turnorder.\r### Sort turnorder\r`!durations sort|[starting round]|[round formula]|[sort order]`\re.g. `!durations sort|5|+1|ascending`\rSorts the turnorder in the specified order. If the turnorder has not yet been sorted, an item to track the number of rounds will be added. If the turnorder has already been sorted, sorting it again will retain the current turn item.\rThe `starting round` argument must be an integer, and determines what round the turnorder will start on. By default the starting round is `1`.\rThe `round formula` argument must be either a plus sign `+` or minus sign `-` followed by an integer. This determines how the round number will update. By default the round formula is `+1`.\rThe `sort order` argument must be either `ascending` or `descending`, and determines how the turnorder is sorted. 'Ascending' will place the items with a lower initiative first, while 'descending' will place items with a higher initiative first. The default sort order is `descending`.\r### Round display name\r`!durations config|roundDisplayName|[new display name]`\re.g. `!durations config|roundDisplayName|ROUND`\rThis will update the turnorder item that is added for tracking the current round when the turnorder is sorted. The default display name is `<= Round =>`.\r### Auto-clear turnorder\r`!durations config|autoClearTurnorder|[true or false]`\re.g. `!durations config|autoClearTurnorder|false`\rDetermines whether the turnorder is automatically cleared anytime it is closed. By default this setting is `true`.\rNote: keeping the turnorder open and closing the Roll20 tab shouldn't cause the turnorder to autoclear. The autoclear setting should only trigger when closing the turnorder itself.\r### Auto-delete durations\r`!durations config|autoDeleteDurations|[true or false]`\re.g. `!durations config|autoDeleteDurations|false`\rDetermines whether duration or GM duration items that reach a length of 0 are automatically deleted or not. By default this setting is `true`.",
  "authors": "thatblindgeye",
  "roll20userid": "67635",
  "useroptions": [],
  "dependencies": [],
  "modifies": {
    "state.Durations": "read,write",
    "campaign.turnorder": "read,write",
    "macros": "read,write",
    "chat": "read,write"
  },
  "conflicts": []
}
